import math
黄金分割率=(math.sqrt(5)+1)/2-1.
print(黄金分割率)
def 黄金分割(f,起点,终点,精度):
	while(abs(终点-起点))>=精度:
		分割点1=起点+(1-黄金分割率)*(终点-起点)
		分割点2=起点+黄金分割率*(终点-起点)

		if f(分割点1)>f(分割点2):
			起点=分割点1
			分割点1=分割点2
			分割点2=起点+黄金分割率*(终点-起点)
		else:
			终点=分割点2
			分割点2=分割点1
			分割点2=起点+黄金分割率*(终点-起点)
	return (分割点1+分割点2)/2

if __name__ == '__main__':
	求极小=True
	f=lambda x:x**3-x**2-30*x if 求极小 else -(x**3-x**2-30*x)#定义Inline函数
	if 求极小:
		print(黄金分割(f,起点=3.3,终点=4.1,精度=1e-8))
	else:
		print(黄金分割(f,起点=-3.27,终点=-1.99,精度=1e-8))

